Revit 2018 API
UIApplication Constructor
 Use a database level Application to construct a UI-level Application.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public UIApplication(
	Application revitApp
)
Visual Basic
Public Sub New ( _
	revitApp As Application _
)
Visual C++
public:
UIApplication(
	Application^ revitApp
)
Parameters
revitApp
Type: Autodesk.Revit.ApplicationServices.Application
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
UIApplication Class
Autodesk.Revit.UI Namespace